import { Link } from 'react-router-dom'

export default function Donate() {
  return (
    <div style={{ padding: 20 }}>
      <h2>☕ Поддержка проекта</h2>

      <p>
        Денежные средства перечисляются в качестве добровольного пожертвования
        автору проекта.
        <br />
        Перечисление средств не является оплатой услуг и не влечёт возникновения
        обязательств.
      </p>

      <a
        href="https://tbank.ru/cf/AhDR5Hn9ci3"
        target="_blank"
        rel="noreferrer"
      >
        <button>☕ Поддержать проект</button>
      </a>

      <p style={{ fontSize: 12, opacity: 0.6 }}>
        Все пожертвования являются добровольными и не предполагают оказания услуг.
      </p>

      <Link to="/">
        <button>🏠 В меню</button>
      </Link>
    </div>
  )
}
