export default function Donate() {
  return (
    <div>
      <h2>Поддержка проекта</h2>
      <p>
        Денежные средства перечисляются в качестве добровольного пожертвования автору проекта.
        Перечисление средств не является оплатой услуг и не влечёт возникновения обязательств.
      </p>
      <a href="https://tbank.ru/cf/AhDR5Hn9ci3" target="_blank">
        ☕ Поддержать проект
      </a>
      <small>
        Все пожертвования являются добровольными и не предполагают оказания услуг.
      </small>
    </div>
  )
}
